#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyzw        0     NONE   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
;
; shader debug name: dc5d11efd281486d7bf8465652d4ff8b.pdb
; shader hash: dc5d11efd281486d7bf8465652d4ff8b
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; COLOR                    0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
;
; Buffer Definitions:
;
; cbuffer MVP0
; {
;
;   struct hostlayout.MVP0
;   {
;
;       column_major float4x4 mtWld;                  ; Offset:    0

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.7.2308.16 (52da17e29)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !27)
!1 = !DIFile(filename: "SampleVertexShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 22, type: !5, isLocal: false, isDefinition: true, scopeLine: 23, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !23}
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "INPUT_PS", file: !1, line: 16, size: 256, align: 32, elements: !8)
!8 = !{!9, !22}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !7, file: !1, line: 18, baseType: !10, size: 128, align: 32)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 7, baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 7, size: 128, align: 32, elements: !12, templateParams: !18)
!12 = !{!13, !15, !16, !17}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !11, file: !1, line: 7, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!14 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !11, file: !1, line: 7, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !11, file: !1, line: 7, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !11, file: !1, line: 7, baseType: !14, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!18 = !{!19, !20}
!19 = !DITemplateTypeParameter(name: "element", type: !14)
!20 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 4)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !7, file: !1, line: 19, baseType: !10, size: 128, align: 32, offset: 128)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "INPUT_VS", file: !1, line: 10, size: 256, align: 32, elements: !24)
!24 = !{!25, !26}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !23, file: !1, line: 12, baseType: !10, size: 128, align: 32)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !23, file: !1, line: 13, baseType: !10, size: 128, align: 32, offset: 128)
!27 = !{!28, !51, !52}
!28 = !DIGlobalVariable(name: "mtWld", linkageName: "\01?mtWld@MVP0@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 5, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 5, size: 512, align: 32, elements: !31, templateParams: !48)
!31 = !{!32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !30, file: !1, line: 5, baseType: !14, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!48 = !{!19, !49, !50}
!49 = !DITemplateValueParameter(name: "row_count", type: !21, value: i32 4)
!50 = !DITemplateValueParameter(name: "col_count", type: !21, value: i32 4)
!51 = !DIGlobalVariable(name: "mtViw", linkageName: "\01?mtViw@MVP0@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 6, type: !29, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariable(name: "mtPrj", linkageName: "\01?mtPrj@MVP0@@3V?$matrix@M$03$03@@B", scope: !0, file: !1, line: 7, type: !29, isLocal: false, isDefinition: true)
!53 = !{i32 2, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{!"dxcoob 1.7.2308.16 (52da17e29)"}
!56 = !{!"SampleVertexShader.hlsl", !"\0A\0Acbuffer MVP0 : register(b0)\0A{\0A\09matrix mtWld;\0A\09matrix mtViw;\0A\09matrix mtPrj;\0A};\0A\0Astruct INPUT_VS\0A{\0A\09float4 p: POSITION;\0A\09float4 d: COLOR0;\0A};\0A\0Astruct INPUT_PS\0A{\0A\09float4 p : SV_POSITION;\0A\09float4 d : COLOR0;\0A};\0A\0AINPUT_PS main(INPUT_VS vsi)\0A{\0A\09INPUT_PS o;\0A\09float4 p = vsi.p;\0A\09p = mul(mtWld, p);\0A\09p = mul(mtViw, p);\0A\09p = mul(mtPrj, p);\0A\09o.p = p;\0A\09o.d = vsi.d;\0A\09return o;\0A}\0A"}
!57 = !{!"SampleVertexShader.hlsl"}
!58 = !{!"-E", !"main", !"-T", !"vs_6_0", !"/Fo", !"C:\5CUsers\5Cuser\5CDesktop\5CHeesungOh_25114\5C_git\5Cspinningcube12-master\5Cx64\5CDebug\5CSampleVertexShader.cso", !"/Od", !"/Zi", !"-Qembed_debug"}
!59 = !{i32 1, i32 0}
!60 = !{i32 1, i32 7}
!61 = !{!"vs", i32 6, i32 0}
!62 = !{null, null, !63, null}
!63 = !{!64}
!64 = !{i32 0, %hostlayout.MVP0* undef, !"MVP0", i32 0, i32 0, i32 1, i32 192, null}
!65 = !{i32 0, %hostlayout.MVP0 undef, !66}
!66 = !{i32 192, !67, !69, !70}
!67 = !{i32 6, !"mtWld", i32 2, !68, i32 3, i32 0, i32 7, i32 9}
!68 = !{i32 4, i32 4, i32 2}
!69 = !{i32 6, !"mtViw", i32 2, !68, i32 3, i32 64, i32 7, i32 9}
!70 = !{i32 6, !"mtPrj", i32 2, !68, i32 3, i32 128, i32 7, i32 9}
!71 = !{i32 1, void ()* @main, !72}
!72 = !{!73}
!73 = !{i32 0, !2, !2}
!74 = !{[10 x i32] [i32 8, i32 8, i32 15, i32 15, i32 15, i32 15, i32 16, i32 32, i32 64, i32 128]}
!75 = !{void ()* @main, !"main", !76, !62, !85}
!76 = !{!77, !82, null}
!77 = !{!78, !81}
!78 = !{i32 0, !"POSITION", i8 9, i8 0, !79, i8 0, i32 1, i8 4, i32 0, i8 0, !80}
!79 = !{i32 0}
!80 = !{i32 3, i32 15}
!81 = !{i32 1, !"COLOR", i8 9, i8 0, !79, i8 0, i32 1, i8 4, i32 1, i8 0, !80}
!82 = !{!83, !84}
!83 = !{i32 0, !"SV_Position", i8 9, i8 3, !79, i8 4, i32 1, i8 4, i32 0, i8 0, !80}
!84 = !{i32 1, !"COLOR", i8 9, i8 0, !79, i8 2, i32 1, i8 4, i32 1, i8 0, !80}
!85 = !{i32 0, i64 1}
!86 = !DILocation(line: 22, column: 24, scope: !4)
!87 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "o", scope: !4, file: !1, line: 24, type: !7)
!88 = !DIExpression(DW_OP_bit_piece, 128, 32)
!89 = !DILocation(line: 24, column: 11, scope: !4)
!90 = !DIExpression(DW_OP_bit_piece, 160, 32)
!91 = !DIExpression(DW_OP_bit_piece, 192, 32)
!92 = !DIExpression(DW_OP_bit_piece, 224, 32)
!93 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "vsi", arg: 1, scope: !4, file: !1, line: 22, type: !23)
!94 = !DIExpression(DW_OP_bit_piece, 0, 32)
!95 = !DIExpression(DW_OP_bit_piece, 32, 32)
!96 = !DIExpression(DW_OP_bit_piece, 64, 32)
!97 = !DIExpression(DW_OP_bit_piece, 96, 32)
!98 = !DILocation(line: 25, column: 9, scope: !4)
!99 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "p", scope: !4, file: !1, line: 25, type: !10)
!100 = !DILocation(line: 26, column: 10, scope: !4)
!101 = !DILocation(line: 26, column: 6, scope: !4)
!102 = !DILocation(line: 26, column: 4, scope: !4)
!103 = !DILocation(line: 27, column: 10, scope: !4)
!104 = !DILocation(line: 27, column: 6, scope: !4)
!105 = !DILocation(line: 27, column: 4, scope: !4)
!106 = !DILocation(line: 28, column: 10, scope: !4)
!107 = !DILocation(line: 28, column: 6, scope: !4)
!108 = !DILocation(line: 28, column: 4, scope: !4)
